<!-- ---------------------------------------------------- -->
  <div class="col-sm-3 col-md-3 col-lg-3">
	<!-- logo -->  
    <div class="img-responsive">
      <img src="https://www.dropbox.com/s/220ncn0o5danuey/pandas-ipython-tutorials-hedaro.jpg?dl=1" title="Pandas Tutorial | Hedaro" alt="Pandas Tutorial | Hedaro">    
    </div>
	<!-- logo -->	
  </div>
<!-- ---------------------------------------------------- --> 
  <div class="col-sm-6 col-md-6 col-lg-6">
	<!-- Pandas Tutorial -->  
	  <center>
	    <br>
        <h1>Group By Practice</h1>
        <p>Let's practice Pandas using the <strong>Group By</strong> function and add some plots for fun.</p>
	  </center>	
    <!-- Pandas Tutorial -->	
  </div>
<!-- ---------------------------------------------------- -->

<strong>The most popular Pandas tutorials. </strong><a href="https://gumroad.com/l/jVeRh" target="_blank"><strong>Get a total of 7 tutorials!</strong></a>

In [1]:
import pandas as pd
import sys
%matplotlib inline

In [2]:
print('Python version ' + sys.version)
print('Pandas version ' + pd.__version__)

Python version 3.5.1 |Anaconda custom (64-bit)| (default, Feb 16 2016, 09:49:46) [MSC v.1900 64 bit (AMD64)]
Pandas version 0.19.2

In [3]:
raw = pd.read_csv('Test_9_17_Python.csv')
raw.head()

       Date Symbol  Volume
0  1/1/2013      A       0
1  1/2/2013      A     200
2  1/3/2013      A    1200
3  1/4/2013      A    1001
4  1/5/2013      A    1300

In [4]:
df2 = raw.copy()

In [5]:
df2['Date'] = pd.to_datetime(df2['Date'])

In [6]:
df2.dtypes

Date      datetime64[ns]
Symbol            object
Volume             int64
dtype: object

In [7]:
pool = ['boy','girl']
pool = pool*int(len(df2)/2)
df2['Gender'] = pool
df = df2.copy()
df.head()

        Date Symbol  Volume Gender
0 2013-01-01      A       0    boy
1 2013-01-02      A     200   girl
2 2013-01-03      A    1200    boy
3 2013-01-04      A    1001   girl
4 2013-01-05      A    1300    boy

# Group one column  

[Click Here](http://www.hedaro.com/pandas-groupby) if you are unfamilar with the ***GroupBy*** function.

In [8]:
group = df.groupby('Symbol')

group.sum()

        Volume
Symbol
A         5051
B         4830
C       101800
E        30800

In [9]:
def suma(group):
    return group.sum()

group.apply(suma)

        Volume
Symbol
A         5051
B         4830
C       101800
E        30800

In [10]:
def suma(group):
    return group.sum()

df['addition'] = group.transform(suma)['Volume']
df.head()

        Date Symbol  Volume Gender  addition
0 2013-01-01      A       0    boy      5051
1 2013-01-02      A     200   girl      5051
2 2013-01-03      A    1200    boy      5051
3 2013-01-04      A    1001   girl      5051
4 2013-01-05      A    1300    boy      5051

In [11]:
def test(group):
    mask1 = group.apply(lambda x: x[1]=='boy' and x[2]>1000, axis=1)
    return group[mask1]

group.apply(test)

                Date Gender  Volume
Symbol
A      2  2013-01-03    boy    1200
       4  2013-01-05    boy    1300
B      8  2013-03-10    boy    1180
C      10 2013-01-05    boy   56600
E      14 2013-05-21    boy    1700
       16 2013-05-23    boy    2100
       18 2013-05-25    boy   12000

# Two columns

In [12]:
group = df.groupby(['Symbol', 'Gender'])

group.sum()

               Volume  addition
Symbol Gender
A      boy       2500     15153
       girl      2551     15153
B      boy       1680      9660
       girl      3150      9660
C      boy      56800    203600
       girl     45000    101800
E      boy      16800    123200
       girl     14000    154000

In [13]:
def suma(group):
    return group['Volume'].sum()

group.apply(suma)

Symbol  Gender
A       boy        2500
        girl       2551
B       boy        1680
        girl       3150
C       boy       56800
        girl      45000
E       boy       16800
        girl      14000
dtype: int64

In [14]:
def suma(group):
    return group.sum()

df['addition'] = group.transform(suma)['Volume']
df.head()

        Date Symbol  Volume Gender  addition
0 2013-01-01      A       0    boy      2500
1 2013-01-02      A     200   girl      2551
2 2013-01-03      A    1200    boy      2500
3 2013-01-04      A    1001   girl      2551
4 2013-01-05      A    1300    boy      2500

In [15]:
def test(group):
    mask1 = group.apply(lambda x: x[1]>1000, axis=1)
    return group[mask1]

group.apply(test)

                       Date  Volume  addition
Symbol Gender
A      boy    2  2013-01-03    1200      5051
              4  2013-01-05    1300      5051
       girl   3  2013-01-04    1001      5051
              5  2013-01-06    1350      5051
B      boy    8  2013-03-10    1180      4830
       girl   7  2013-03-09    1150      4830
              9  2013-03-11    2000      4830
C      boy    10 2013-01-05   56600    101800
       girl   11 2013-01-06   45000    101800
E      boy    14 2013-05-21    1700     30800
              16 2013-05-23    2100     30800
              18 2013-05-25   12000     30800
       girl   13 2013-05-20    1300     30800
              17 2013-05-24    8000     30800
              19 2013-05-26    1900     30800
              21 2013-05-28    1900     30800

<p class="text-muted">This tutorial was created by <a href="http://www.hedaro.com" target="_blank"><strong>HEDARO</strong></a></p>